plugins {
    // Apply the shared build logic from a convention plugin.
    // The shared code is located in `buildSrc/src/main/kotlin/kotlin-jvm.gradle.kts`.
    id("buildsrc.convention.kotlin-jvm")
    // Apply Kotlin Serialization plugin from `gradle/libs.versions.toml`.
    alias(libs.plugins.kotlinPluginSerialization)
    id("io.ebean") version "13.2.0"
}

dependencies {
/* =====================================================================================================================
 プラグインの依存関係: ビルドプロセス自体に必要なプラグイン
===================================================================================================================== */

/* =====================================================================================================================
 公式ライブラリ: 言語が公式にサポートするライブラリ
===================================================================================================================== */
    // Kotlinの公式ライブラリ群
    implementation(libs.bundles.kotlinxEcosystem)

/* =====================================================================================================================
 主要なフレームワーク: アプリケーションの基盤となるフレームワーク
===================================================================================================================== */
    // Ebean本体
    implementation("io.ebean:ebean:13.2.0")

    // EbeanのfindやsaveなどのAPIを使えるようにする
    implementation("io.ebean:ebean-api:13.2.0")

    // Ebeanが提供するクエリビルダ
    implementation("io.ebean:ebean-querybean:13.2.0")

    // Liquibaseのコアライブラリ
    runtimeOnly("org.liquibase:liquibase-core")

    // DDL生成用
    runtimeOnly("io.ebean:ebean-ddl-runner:latest_version")
    runtimeOnly("org.liquibase:liquibase-core")
/* =====================================================================================================================
 ユーティリティ: 補助的な役割を持つライブラリ
===================================================================================================================== */
    // データベースドライバをH2に変更
    implementation("com.h2database:h2:2.1.214")

/* =====================================================================================================================
 テスト用の依存関係
===================================================================================================================== */
    // テスト用
    testImplementation(kotlin("test"))
}